0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 1 0);

boundaryField
{
    inlet
    {
		type            flowRateInletVelocity;
		volumetricFlowRate
		{
			type        table;
			timeStart   0;
			values
			(
				(0     0.01)      // t=0   , Q=0.01 m3/s
				(10    0.02)      // t=10s , Q=0.02 m3/s
				(20    0.015)     // t=20s , Q=0.015 m3/s
				(30    0.03)      // t=30s , Q=0.03 m3/s
			);
		}
		value           uniform (0 0 0); // Dirección de la velocidad
		direction       (0 1 0); // Cambia según tu geometría
	}


    walls
    {
        type            noSlip;
    }

    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    outlet1
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    outlet2
    {
        type            flowRateOutletVelocity;
        volumetricFlowRate   constant 0.05; // Ajusta este valor al caudal fijo deseado en outlet2
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
