system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    Alaverga;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (11.5 28.8 0.1) (12.1 30 0.16);
        }
    }
    {
        name    AlavergaFaces;
        type    faceSet;
        action  new;
        source  cellToFace;
		set		Alaverga;
        option  all;
    }
    {
        name    AlavergaZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        set  	AlavergaFaces;
		option 	all;
    }
);

// ************************************************************************* //